systems/EFI/- Arkiv/100614 Pakker til konsortiet AD, BFY, Captia, DMR, ES, Forskud Slut 3S Svur, Slsp, eIndkomst/100611 ES/WSDL/package/wsdl/VirksomhedAlleEjerLederRelationSamlingHent.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://skat.dk/begrebsmodel/2009/01/15/" name="VirksomhedAlleEjerLederRelationSamlingHentService" xmlns:fase2.1="http://skat.dk/begrebsmodel/2009/01/15/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
   
   <xs:annotation xmlns:xs="http://www.w3.org/2001/XMLSchema">
      
      <xs:documentation>Formålet er at hente oplysninger om hvilke ejere og/eller ledere en virksomhed har.  JaNej markering anvendelse: hvis Ja hentes oplysninger, hvis Nej hentes oplysninger ikke.  Er søgedato udfyldt hentes oplysninger, som er gældende fra og med den anførte søgedato eller i den angivne søgeperiode.  Er søgedato ikke udfyldt hentes alle oplysninger. Er EjerTypeRolleValg udfyldt hentes alene ejerforhold for virksomheder, der opfylder Valg. Er LedelsesTypeValg udfyldt hentes alene ledelsesforhold for virksomheder, der opfylder Valg. Er EjerTypeRolleValg og LedelsesTypeValg udfyldt hentes ejerforhold og ledelsesforhold, der opfylder Valg.  Vedr EjerTypeValg: Er driftsform udfyldt hentes alene ejerforhold for virksomheder, som har den anførte driftsform.  Er både driftsform, ejerrolle og ejertype udfyldt hentes ejerforhold, som gælder for den anførte kombinati-on af ejerrolle, ejertype og driftsform.  Der hentes uanset søgedato altid aktuelt gældende kort navn for virksomhed samt adresse af typen virk-somhedsadresse for SENummer og eventuelt CVRNummer. </xs:documentation>
   
   </xs:annotation>
   
   <types>
      
      <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://skat.dk/begrebsmodel/2009/01/15/">
         
         <xsd:include schemaLocation="../service/VirksomhedAlleEjerLederRelationSamlingHentInterface.xsd"/>
      
      </xsd:schema>
   
   </types>
   
   <message name="VirksomhedAlleEjerLederRelationSamlingHentServiceRequest">
      
      <part name="Request" element="fase2.1:VirksomhedAlleEjerLederRelationSamlingHent_I"/>
   
   </message>
   
   <message name="VirksomhedAlleEjerLederRelationSamlingHentServiceResponse">
      
      <part name="Response" element="fase2.1:VirksomhedAlleEjerLederRelationSamlingHent_O"/>
   
   </message>
   
   <message name="KompenserTransRequest">
      
      <part name="Request" element="fase2.1:KompenserTrans"/>
   
   </message>
   
   <message name="KompenserTransResponse">
      
      <part name="Response" element="fase2.1:KompenserTransSvar"/>
   
   </message>
   
   <portType name="VirksomhedAlleEjerLederRelationSamlingHentServicePortType">
      
      <operation name="getVirksomhedAlleEjerLederRelationSamlingHent">
         
         <input message="fase2.1:VirksomhedAlleEjerLederRelationSamlingHentServiceRequest"/>
         
         <output message="fase2.1:VirksomhedAlleEjerLederRelationSamlingHentServiceResponse"/>
      
      </operation>
      
      <operation name="getKompenserTrans">
         
         <input message="fase2.1:KompenserTransRequest"/>
         
         <output message="fase2.1:KompenserTransResponse"/>
      
      </operation>
   
   </portType>

</definitions>
