ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/es/vaelrsh/ValidRequest_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header>
    </soapenv:Header>
    <soapenv:Body>
        <ns:VirksomhedAlleEjerLederRelationSamlingHent_I revision="?">
            <ns:Kontekst>
                <ho:HovedOplysninger xmlns:ho="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <ho:TransaktionsID>TRANSAKTIONS_ID</ho:TransaktionsID>
                    <ho:TransaktionsTid>TRANSAKTIONS_TID</ho:TransaktionsTid>
                </ho:HovedOplysninger>
            </ns:Kontekst>
            <ns:AlleEjerLederVirksomhedValgSamling>
                <ns:AlleEjerLederVirksomhedValg>
                    <ns:VirksomhedSENummer>VIRKSOMHED_SE_NUMMER</ns:VirksomhedSENummer>
                    <ns:SøgePeriode>
                        <ns:SøgeDatoFra>SOGE_DATO_FRA</ns:SøgeDatoFra>
                    </ns:SøgePeriode>
                    <ns:EjerLederOplysningerValg>
                        <ns:EjerJaNej>1</ns:EjerJaNej>
                        <ns:LederJaNej>1</ns:LederJaNej>
                    </ns:EjerLederOplysningerValg>
                    <ns:EjerTypeRolleValgSamling/>
                    <ns:LederTypeValgSamling/>
                </ns:AlleEjerLederVirksomhedValg>
            </ns:AlleEjerLederVirksomhedValgSamling>
        </ns:VirksomhedAlleEjerLederRelationSamlingHent_I>
    </soapenv:Body>
</soapenv:Envelope>